read_verilog ../spinal/ExampleTop.sim.v
hierarchy -check -top ExampleTop
#prep -flatten
#proc
#flatten
#opt
write_ilang ExampleTop.sim.ilang
write_cxxrtl ExampleTop.sim.cpp

